{
  "description": "\n                    Kraigg Brathwaite'sdefiance and more inclement weather ensured a draw on the final day of the second Test between the West Indies and Sri Lanka at the Darren Sammy Stadium in St Lucia on Monday.        ",
  "origin_url": "https://m.sport24.co.za/Cricket/chandimal-sweats-as-sri-lanka-windies-draw-2nd-test-20180619?_e_pi_=7%2CPAGE_ID10%2C5739613672",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 05:08"
  ],
  "title": "Chandimal sweats as Sri Lanka, Windies draw 2nd Test"
},
{
  "description": "\n                    The article quoting Mr. Asanka Gurusinha, Sri Lanka Team Manager on the current West Indies tour reported that the Sri Lanka team was going to forfeit the ongoing Test match, following the incidents that took place on day three. However Mr. Gurusinha says he never made such a statement to the report        ",
  "origin_url": "http://island.lk/index.php?page_cat=article-details&page=article-details&code_title=186530",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 01:55"
  ],
  "title": "SLC Clarifies"
},
{
  "description": "\n                    Kasun Rajitha put Sri Lanka in the box seat with a stunning spell of nine overs where he took two wickets for 15 runs after West Indies began their chase of 296 runs to win the match here at Gros Islet’s Darren Sammy Stadium in the West Indies.        ",
  "origin_url": "http://www.island.lk/index.php?page_cat=article-details&page=article-details&code_title=186529",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 04:55"
  ],
  "title": "Debutant Rajitha stuns Sri Lanka"
},
{
  "description": null,
  "origin_url": null,
  "time": [],
  "title": "ඇමතිවරයාගේ ඉල්ලීම ඉවත දැමූ ක්‍රිකට් ජ්‍යේෂ්ඨයින් කියපු කතාවේ හරය"
},
{
  "description": "\n                    Here’s a look at five previous such instances when a team responded to dubious umpiring decisions with a form of protest.        ",
  "origin_url": "http://www.dailynews.lk/2018/06/19/sports/154351/when-teams-protested-against-umpiring-decisions",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 05:00"
  ],
  "title": "When teams protested against umpiring decisions"
},
{
  "description": "\n                    Kraigg Brathwaite's defiance and more inclement weather ensured a draw on the final day of the second Test between the West Indies and Sri Lanka at the Darren Sammy Stadium in St Lucia on Monday (Jun 18). On a day when their captain, Dinesh Chandimal, who has been charged by umpires Aleem Dar and...        ",
  "origin_url": "https://www.channelnewsasia.com/news/sport/cricket-sri-lanka-and-west-indies-draw-rain-delayed-second-test-10445378",
  "time": [
    "Submitted by ",
    " on June 18, 2018 - 22:16"
  ],
  "title": "Sri Lanka and West Indies draw rain delayed second Test"
},
{
  "description": "\n                    Many think that he is a future Sri Lanka captain. Some think he is another Aravinda or Mahela in the making. His 26th Test brought his sixth fifty, 87 timely runs for the Lankans, yet it was actually missing of his sixth century, the second in this tour.        ",
  "origin_url": "http://island.lk/index.php?page_cat=article-details&page=article-details&code_title=186532",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 01:53"
  ],
  "title": "Our preparation in Kandy produced results – Kusal Mendis"
},
{
  "description": "\n                    Arjuna Ranatunga expressed his gratitude to Roshan Mahanama, Kumar Sangakkara, Mahela Jayawardene and Muthiah Muralitharan for taking a wise decision, not to walk into a trap and fall to gamblers.        ",
  "origin_url": "http://www.dailynews.lk/2018/06/19/sports/154385/don%E2%80%99t-push-senior-cricketers-trap-ranatunga-tells-sports-minister",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 04:57"
  ],
  "title": "Don’t push senior cricketers into a trap - Ranatunga tells Sports Minister"
},
{
  "description": "\n                    Two matches of the Sri Lanka Cricket (SLC) U19 Provincial Limited Overs Tournament 2018 were concluded today at Colombo. All-round efforts of Mahesh Theekshana (Western Province North) and S. Mathushan (Northern Province) were the key highlights of today’s play.\r\n        ",
  "origin_url": "http://www.thepapare.com/mahesh-theekshana-demolishes-north-central-province/",
  "time": [
    "Submitted by ",
    " on June 18, 2018 - 12:21"
  ],
  "title": "Mahesh Theekshana demolishes North Central Province"
},
{
  "description": "\n                    He took a few wickets with pace. Then a few more with bounce. Even some with lateral movement. Shannon Gabriel was so good in St Lucia that he vaulted into the record books. Only once has a West Indian bowler struck more than the 13 times he did in a single Test match. And that was back in 1976..        ",
  "origin_url": "http://www.espncricinfo.com/story/_/id/23837340/words-describe-shannon-gabriel-performance-jason-holder",
  "time": [
    "Submitted by ",
    " on June 19, 2018 - 01:50"
  ],
  "title": "'Words can't describe Gabriel's performance' - Holder"
},
